{"version": "1.0", "model": {"type": "BPE", "vocab": {"<0>": 0, "<1>": 1, "<2>": 2, "<3>": 3, "<4>": 4, "<5>": 5, "<6>": 6, "<7>": 7, "<8>": 8, "<9>": 9, "<10>": 10, "<11>": 11, "<12>": 12, "<13>": 13, "<14>": 14, "<15>": 15, "<16>": 16, "<17>": 17, "<18>": 18, "<19>": 19, "<20>": 20, "<21>": 21, "<22>": 22, "<23>": 23, "<24>": 24, "<25>": 25, "<26>": 26, "<27>": 27, "<28>": 28, "<29>": 29, "<30>": 30, "<31>": 31, " ": 32, "!": 33, "\"": 34, "#": 35, "$": 36, "%": 37, "&": 38, "'": 39, "(": 40, ")": 41, "*": 42, "+": 43, ",": 44, "-": 45, ".": 46, "/": 47, "0": 48, "1": 49, "2": 50, "3": 51, "4": 52, "5": 53, "6": 54, "7": 55, "8": 56, "9": 57, ":": 58, ";": 59, "<": 60, "=": 61, ">": 62, "?": 63, "@": 64, "A": 65, "B": 66, "C": 67, "D": 68, "E": 69, "F": 70, "G": 71, "H": 72, "I": 73, "J": 74, "K": 75, "L": 76, "M": 77, "N": 78, "O": 79, "P": 80, "Q": 81, "R": 82, "S": 83, "T": 84, "U": 85, "V": 86, "W": 87, "X": 88, "Y": 89, "Z": 90, "[": 91, "\\": 92, "]": 93, "^": 94, "_": 95, "`": 96, "a": 97, "b": 98, "c": 99, "d": 100, "e": 101, "f": 102, "g": 103, "h": 104, "i": 105, "j": 106, "k": 107, "l": 108, "m": 109, "n": 110, "o": 111, "p": 112, "q": 113, "r": 114, "s": 115, "t": 116, "u": 117, "v": 118, "w": 119, "x": 120, "y": 121, "z": 122, "{": 123, "|": 124, "}": 125, "~": 126, "<127>": 127, "<128>": 128, "<129>": 129, "<130>": 130, "<131>": 131, "<132>": 132, "<133>": 133, "<134>": 134, "<135>": 135, "<136>": 136, "<137>": 137, "<138>": 138, "<139>": 139, "<140>": 140, "<141>": 141, "<142>": 142, "<143>": 143, "<144>": 144, "<145>": 145, "<146>": 146, "<147>": 147, "<148>": 148, "<149>": 149, "<150>": 150, "<151>": 151, "<152>": 152, "<153>": 153, "<154>": 154, "<155>": 155, "<156>": 156, "<157>": 157, "<158>": 158, "<159>": 159, "<160>": 160, "<161>": 161, "<162>": 162, "<163>": 163, "<164>": 164, "<165>": 165, "<166>": 166, "<167>": 167, "<168>": 168, "<169>": 169, "<170>": 170, "<171>": 171, "<172>": 172, "<173>": 173, "<174>": 174, "<175>": 175, "<176>": 176, "<177>": 177, "<178>": 178, "<179>": 179, "<180>": 180, "<181>": 181, "<182>": 182, "<183>": 183, "<184>": 184, "<185>": 185, "<186>": 186, "<187>": 187, "<188>": 188, "<189>": 189, "<190>": 190, "<191>": 191, "<192>": 192, "<193>": 193, "<194>": 194, "<195>": 195, "<196>": 196, "<197>": 197, "<198>": 198, "<199>": 199, "<200>": 200, "<201>": 201, "<202>": 202, "<203>": 203, "<204>": 204, "<205>": 205, "<206>": 206, "<207>": 207, "<208>": 208, "<209>": 209, "<210>": 210, "<211>": 211, "<212>": 212, "<213>": 213, "<214>": 214, "<215>": 215, "<216>": 216, "<217>": 217, "<218>": 218, "<219>": 219, "<220>": 220, "<221>": 221, "<222>": 222, "<223>": 223, "<224>": 224, "<225>": 225, "<226>": 226, "<227>": 227, "<228>": 228, "<229>": 229, "<230>": 230, "<231>": 231, "<232>": 232, "<233>": 233, "<234>": 234, "<235>": 235, "<236>": 236, "<237>": 237, "<238>": 238, "<239>": 239, "<240>": 240, "<241>": 241, "<242>": 242, "<243>": 243, "<244>": 244, "<245>": 245, "<246>": 246, "<247>": 247, "<248>": 248, "<249>": 249, "<250>": 250, "<251>": 251, "<252>": 252, "<253>": 253, "<254>": 254, "<255>": 255}, "merges": []}, "added_tokens": [{"id": 0, "content": "<pad>", "special": true, "single_word": false, "lstrip": false, "rstrip": false, "normalized": false}, {"id": 1, "content": "<eos>", "special": true, "single_word": false, "lstrip": false, "rstrip": false, "normalized": false}]}